////【问题描述】用整数表示时间，如：1050表示10点50分，2010表示20点10分，现输入两个时间，求两个时间的和。
////例： 2030 + 850 = 520   不是2880
////1055 + 850 = 1945 不是1905
////【输入形式】两行数据，每行一个整数。
////【输出形式】输出相加后的时间整数。如果是0点0分，输出"000"
////【样例输入】2030
////850
////【样例输出】520
////【样例说明】表示20点30分加8点50分得5点20分。
////【评分标准】本题共4个测试点，每个测试点0.25分，全部答对1.0分。
//
//
//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//int main()
//{
//    int time1, time2;
//    int h1, h2, m1, m2;
//    int h, m;
//
//    scanf("%d %d", &time1, &time2);
//
//    h1 = time1 / 100;
//    m1 = time1 % 100;
//    h2 = time2 / 100;
//    m2 = time2 % 100;
//
//    int nmb = 0;
//    m = m1 + m2;
//    
//    if (m >= 60)
//    {
//        m = m % 60;
//        nmb = 1;
//    }
//
//    h = h1 + h2 + nmb;
//    h = h % 24;
//
//    if (h == 0 && m == 0)
//    {
//        printf("000");
//        return 0;
//    }
//    printf("%d", 100 * h + m);
//    
//
//        return 0;
//}
//
//
