////【问题描述】
////编写一个程序，将用小数表示的浮点数，转换成科学计数法的形式输出。
////输入的数据没有符号，小数点前后必有数字；小数点前若只有一位数字，可以为0，否则小数点前的最高位数字不为0。
////提示：以字符串形式保存相关数据。
////
////【输入形式】
////从控制台输入一小数，最后有回车换行符，所有输入的字符数不会超过100。
////【输出形式】
////以科学计数法形式输出数据。输出的数据由以下几部分构成：
////1.底数部分是一个小数或整数，若为小数，则小数点前后必有数字。
////  即：小数点前只有一位大于0的数字。若为整数，则只有一位数字，不带小数点。
////2.必有小写字母"e"。
////3.指数部分是一个整数，若大于等于0，则不带正号"+"。若小于0，则需要带负号"-"; ，且整数的最高位数字不为0。
////
////【输入样例1】
////0.000000000000002
////【输出样例1】
////2e-15
////【输入样例2】
////8.9845623489651700659
////【输出样例2】
////8.9845623489651700659e0
////【输入样例3】
////367298599999093453490394859509568659795603.4
////【输出样例3】
////3.672985999990934534903948595095686597956034e41
////【样例说明】
////以小数形式输入数据，然后转换成科学计数法形式输出
////
////
////#define _CRT_SECURE_NO_WARNINGS
////#include<stdio.h>
////int main()
////{
////	int i = 0, m = 0;
////	char ch;
////	char arr[100];	
////	while ((ch = getchar()) && ch != '\n')
////	{
////		arr[i++] = ch;
////	}
////	arr[i] = '=';
////	int len = i;
////	if (arr[0] == '0')
////	{
////		for (i = 2; i < len; i++)
////		{
////			if (arr[i] != '0')
////			{
////				m = i;
////				break;
////			}
////		}
////		int c = -(m - 1);
////		char arr1[100] = { '\0' };
////		arr1[0] = arr[m];
////		if (arr[++m] != '=')
////		{
////			arr1[1] = '.';
////			int h;
////			for (h = 2; arr[m] != '='; m++)
////			{
////				arr1[h++] = arr[m];
////			}
////			arr1[h] = 'e';
////			printf("%s%d", arr1, c);
////		}
////		else
////		{
////			arr1[1] = 'e';
////			printf("%s%d", arr1, c);
////		}
////	}
////	else
////	{
////		int have = 0, m = 0;
////		for (i = 0; i < len; i++)
////		{
////			if (arr[i] != '.')
////			{
////				m = i;            
////			}
////			if (arr[i] == '.')
////			{
////				have = 1;
////				break;
////			}
////		}
////		int c = m;
////		char arr1[100] = { '\0' };
////		arr1[0] = arr[0];
////		if (m == 0 && have == 1)	
////		{
////			for (int i = 1; arr[i] != '='; i++)
////			{
////				arr1[i] = arr[i];
////			}
////			printf("%se%d", arr1,c);
////		}
////		else
////		{
////			arr1[1] = '.';
////			int i, z;
////			for (i = 2, z = 1; i <= m + 1; i++, z++)
////			{
////				arr1[i] = arr[z];
////			}
////			for (; arr[z + 1] != '='; i++, z++)
////			{
////				arr1[i] = arr[z + 1];	
////			}
////			arr1[i] = 'e';
////			printf("%s%d", arr1,c);
////		}
////	}
////	return 0;
////}