//问题描述
//
//在国外，每月的13号和每周的星期5都是不吉利的。特别是当13号那天恰好是星期5时，更不吉利。已知某年以及该年一月一日是星期w（w = 1..7），求出这一年所有13号那天是星期5的月份，按从小到大的顺序输出月份数字。
//
//输入形式
//
//输入有一行，第一个整数为年份，第二个整数为该年一月一日是星期几（w）。（1 <= w <= 7）
//
//输出形式
//
//输出有一到多行，每行一个月份，表示该月的13日是星期五。
//
//样例输入
//2006 7
//样例输出
//1
//10



//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//int year(int n)
//{
//	if (n % 400 == 0 || (n % 4 == 0 && n % 100 != 0))
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int main()
//{
//	int a[12] = { 0,31,28,31,30,31,30,31,31,30,31,30 };
//	int y, w, i;
//	scanf("%d%d", &y, &w);
//	if (year(y) == 1)
//	{
//		a[2] = 29;
//	}
//	int sum = w + 13 - 1;
//	for (i = 0; i < 12; i++)
//	{
//		sum += a[i];
//		if (sum % 7 == 5)
//		{
//			printf("%d\n", i + 1);
//		}
//	}
//	return 0;
//}